Keyrim/drone-stm32f1/Anciennes Versions/flight_controller_v2.1/lib/bsp/VL53L0X/X-NUCLEO-53L0A1.c
/**
 * @file X-NUCLEO-53L0A1.c
 *
 * implement X-NUCLEO-53L0A1 Nucleo BSP
 */
#include "config.h"
#if USE_VL53L0

#include <string.h>
#include  "X-NUCLEO-53L0A1.h"

#include "stm32f1xx_hal.h"
#include "stm32f1_i2c.h"
#include "stm32f1_gpio.h"



#ifndef HAL_I2C_MODULE_ENABLED
#define HAL_I2C_MODULE_ENABLED
#pragma message("hal conf should enable i2c")
#endif

/* when not customized by application define dummy one */
#ifndef XNUCLEO53L0A1_GetI2cBus
/**
 * macro that can be overloaded by user to enforce i2c sharing in RTOS context
 */
#define XNUCLEO53L0A1_GetI2cBus(...) (void)0
#endif

#ifndef XNUCLEO53L0A1_PutI2cBus
/** macro can be overloaded by user to enforce i2c sharing in RTOS context
 */
#   define XNUCLEO53L0A1_PutI2cBus(...) (void)0
#endif

/**
 *@mainpage
 *@image html VL53L0A1_board.jpg "X-NUCLEO-53L0A1 Expansion Board"

  @section Quick BSP links
  - @ref XNUCLEO53L0A1_Interface
  - Board information and configuration @ref XNUCLEO53L0A1_Board
  - Go to Modules panes


  @section XNUCLEO53L0A1_usage How to use X-NUCLEO-53L0A1 BSP ?
  ## Multiple family project ##
   X-NUCLEO-53L0A1 BSP supports multiple STM32 families through unique "stm32xxx_hal.h".
   This file redirects to the targeted stm32 HAL.
   @note This file can also be used to place any customization defines

  @section XNUCLEO53L0A1_conf  How to configure X-NUCLEO-53L0A1 BSP ?
  ## configuration ##
    see @ref VL53L0A1_config

  ### MSP implementation ###
   @li @ref MSP_implement
     @li @ref MSP_implement_common
     @li @ref MSP_implement_STM32x4

*/


/**
 * @defgroup XNUCLEO53L0A1_Board X-NUCLEO-53L0A1 Expansion Board
 * @{
 */

/**
 * @defgroup VL53L0A1_GPIO1_MAP    VL53L0A1 Sensor to MCU interrupt mapping
 *
 * # GPIO mapping ##
 * Various options can be used to map the 3 VL53L0X interrupt lines to MCU. By default, the expansion board is configured in
 * Center on-board vl53l0x mode which means only the center device can be used in interrupt mode. To use left and/or right devices
 * in interrupt mode, it is necessary to adapt the board configuration as described below.
 * ## One interrupt line shared by all sensors ##
 * All VL53L0x GPIO1 pins (open collector outputs) are connected together on the expansion board
 * and level shifter input drives single shared interrupt line to MCU.\n
 * Solder options to operate in this mode:
 * @li U7 and U8 are fitted  (connect GPIO all together before level shifter)
 * @li U10, U11, U15 and U18 are not soldered. (disconnect all level shifted option to arduino connector)
 * @li U14/U17 to select  PA4/PC1  => EXTI4_15_IRQn / EXTI0_1_IRQn (final selection option)
 *
 * see @a #VL53L0A1_GPIO1_C_OPTION for interrupt line selection
 *
 * @note requires @a #VL53L0A1_GPIO1_SHARED to be set (to 1)
 *
 * ##  One interrupt per sensor  ##
 * To use one interrupt per device :\n
 * @li Do not define @a #VL53L0A1_GPIO1_SHARED  or set to 0
 * @li U7 and U8 must not be soldered (disconnect L and R GPIO from C before level shifter)
 *
 * ### Center on-board vl53l0x  ###
 * @li U14 (fitted by default)  CN8#3    PA4
 * @li U17 (*option)         	CN8#5    PC1
 *
 * see @ref VL53L0A1_GPIO1_C_OPTION
 *
 * ### Left satellite ###
 * @li U10 (not fitted by default)  CN5#2    PC7
 * @li U11 (*option)         		CN5#1    PA9
 *
 * see @a #VL53L0A1_GPIO1_L_OPTION
 *
 * ### Right satellite ###
 * @li U18 (not fitted by default)  CN9#3    PA10
 * @li U15 (*option)       			CN9#5    PB5

 *
 * see @a #VL53L0A1_GPIO1_R_OPTION
 *
 * ### Interrupt vectors F401 and L476 ###
 * @li Center PA4 / PC1  => Extit4 / Exti 1
 * @li Left PC7 / PA9 => Extit9_5 / Extit9_5
 * @li Right PA10 / PB5 => Extit15_10 / Extit9_5
 *
 * @warning When selecting alternate option for both sensor L/R interrupt line will shared same vector
 *
 * ### L053 ###
 * @li Center PA4 / PC1  => EXTI4_15_IRQn / EXTI0_1_IRQn
 * @li Left PC7 / PA9  => EXTI4_15_IRQn / EXTI4_15_IRQn
 * @li Right PA10 /  PB5 => EXTI4_15_IRQn / EXTI4_15_IRQn
 *
 * @warning R and L have shared vector use, and will also share C vector if alternate option is selected for C
 */

/**
 * @defgroup  XNUCLEO53L0A1_I2CExpanders I2C expender mapping
 * ## I2C Expanders address and i/o ##
 * Digit 1 2 3 and 4 below are numbered left to right "1234" on see on display
 * ### Expander 0 ###
 * U21 A[2-0]= 001 => i2c address[7..1] 0x43 ([7..0] 0x86 )
 * @li Digit#1  gpio 0 to 6
 * @li Digit#2  gpio 7 to 13
 * @li xshut_l  gpio 14
 * @li xshut_r  gpio 15
 *
 * ### Expander 1 ###
 * U19 A[2-0]= 000 => i2c address[7..1] 0x42 ([7..0] 0x84 )
 * @li Digit#3  gpio 0 to 6
 * @li Digit#4  gpio 7 to 13
 * @li PB1      gpio 14
 * @li xshut    gpio 15
 *
 * @note The 0/1  assignment is "digit" order logical don't look for any sense as  per device address or part number
 * @{
 */

/**
 * Expander 0 i2c address[7..0] format
 */
#define I2cExpAddr0 ((int)(0x43*2))
/**
 * Expander 1 i2c address[7..0] format
 */
#define I2cExpAddr1 ((int)(0x42*2))
/** @} XNUCLEO53L0A1_I2CExpanders*/


/**
 * GPIO monitor pin state register
 * 16 bit register LSB at lowest offset (little endian)
 */
#define GPMR    0x10
/**
 * STMPE1600 GPIO set pin state register
 * 16 bit register LSB at lowest offset (little endian)
 */
#define GPSR    0x12
/**
 * STMPE1600 GPIO set pin direction register
 * 16 bit register LSB at lowest offset
 */
#define GPDR    0x14


/** @} */ /* defgroup  XNUCLEO53L0A1_Board */


/****************************************************
 *@defgroup  XNUCLEO53L0A1_globals
 *@{
 */

/**
 *  i2c handle to be  use of all i2c access
 * end user shall provide it to
 * can be @a XNUCLEO53L0A1_I2C1Configure() @sa XNUCLEO53L0A1_usage
 * @warning do not use any XNUCLEO53L0A1_xxx prior to a first init with valid i2c handle
 */
I2C_HandleTypeDef  XNUCLEO53L0A1_hi2c;


/**
 * cache the full set of expanded GPIO values to avoid i2c reading
 */
static union CurIOVal_u {
    uint8_t bytes[4];   /*!<  4 bytes array i/o view */
    uint32_t u32;       /*!<  single dword i/o view */
}
/** cache the extended IO values */
CurIOVal;

/**
 * lookup table for for digit  to bit position in @a CurIOVal u32
 */
static int  DisplayBitPos[4]={0, 7, 16, 16+7};

/** @} XNUCLEO53L0A1_globals*/

/* Forward definition of private function */

