Keyrim/drone-stm32f1/Anciennes Versions/flight_controller_v2.1/lib/bsp/VL53L0X/X-NUCLEO-53L0A1.c
static int _ExpanderRd(int I2cExpAddr, int index, uint8_t *data, int n_data);
static int _ExpanderWR(int I2cExpAddr, int index, uint8_t *data, int n_data);
static int _ExpandersSetAllIO(void);

/**
 * Expansion board i2c bus recovery
 *
 * We may get reset in middle of an i2c access (h/w reset button, debug or f/w load)
 * hence some agent on bus may be in middle of a transaction and can create issue or even prevent starting (SDA is low)
 * this routine does use gpio to manipulate and recover i2c bus line in all cases.
 */
static void _I2cFailRecover(){
    GPIO_InitTypeDef GPIO_InitStruct;
    int i, nRetry=0;


    // We can't assume bus state based on SDA and SCL state (we may be in a data or NAK bit so SCL=SDA=1)
    // by setting SDA high and toggling SCL at least 10 time we ensure whatever agent and state
    // all agent should end up seeing a "stop" and bus get back to an known idle i2c  bus state

    // Enable I/O
    BSP_GPIO_PinCfg(GPIOB, GPIO_PIN_8, GPIO_MODE_OUTPUT_OD, GPIO_PULLUP, GPIO_SPEED_FREQ_HIGH);
    BSP_GPIO_PinCfg(GPIOB, GPIO_PIN_9, GPIO_MODE_INPUT, GPIO_PULLUP, GPIO_SPEED_FREQ_HIGH);
    //TODO we could do this faster by not using HAL delay 1ms for clk timing
    do{
        for( i=0; i<10; i++){
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_RESET);
            HAL_Delay(2);
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_SET);
            HAL_Delay(2);
        }
//        if( HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_9) == 0 ){
//            static int RetryRecover;
//            RetryRecover++;
//        }
    }while(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_9) == 0 && nRetry++<7);

    if( HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_9) == 0 ){

        //We are still in bad i2c state warm user by blinking led but stay here
    	BSP_GPIO_PinCfg(LED_GREEN_GPIO, LED_GREEN_PIN, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_HIGH);

        do{
            HAL_GPIO_WritePin(LED_GREEN_GPIO, LED_GREEN_PIN, GPIO_PIN_SET);
            HAL_Delay(33);
            HAL_GPIO_WritePin(LED_GREEN_GPIO, LED_GREEN_PIN, GPIO_PIN_RESET);
            HAL_Delay(33);
            HAL_GPIO_WritePin(LED_GREEN_GPIO, LED_GREEN_PIN, GPIO_PIN_SET);
            HAL_Delay(33);
            HAL_GPIO_WritePin(LED_GREEN_GPIO, LED_GREEN_PIN, GPIO_PIN_RESET);
            HAL_Delay(33*20);
        }while(1);
    }
}



int XNUCLEO53L0A1_I2C1Configure() {
    int status;
    GPIO_InitTypeDef GPIO_InitStruct;

    _I2cFailRecover();
# if 0
    /* Peripheral clock enable */
    __GPIOB_CLK_ENABLE();
    __I2C1_CLK_ENABLE();

    /**I2C1 GPIO Configuration\n
     PB8     ------> I2C1_SCL\n
     PB9     ------> I2C1_SDA
     */
    GPIO_InitStruct.Pin = GPIO_PIN_8 | GPIO_PIN_9;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    XNUCLEO53L0A1_hi2c.Instance = I2C1;
#ifdef __STM32F4xx_HAL_H
    XNUCLEO53L0A1_hi2c.Init.ClockSpeed = 400000;
    XNUCLEO53L0A1_hi2c.Init.DutyCycle = I2C_DUTYCYCLE_2;
#else
    /* STM32L4xx and L053 */
    XNUCLEO53L0A1_hi2c.Init.Timing = 0x00300F38; /* set 400KHz fast mode i2c*/
#endif
    XNUCLEO53L0A1_hi2c.Init.OwnAddress1 = 0;
    XNUCLEO53L0A1_hi2c.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    XNUCLEO53L0A1_hi2c.Init.DualAddressMode = I2C_DUALADDRESS_DISABLED;
    XNUCLEO53L0A1_hi2c.Init.OwnAddress2 = 0;
    XNUCLEO53L0A1_hi2c.Init.GeneralCallMode = I2C_GENERALCALL_DISABLED;
    XNUCLEO53L0A1_hi2c.Init.NoStretchMode = I2C_NOSTRETCH_DISABLED;
    status = HAL_I2C_Init(&XNUCLEO53L0A1_hi2c);
    return status;
#endif

    I2C_Init(I2C1, 100000);

    return HAL_OK;
}

int XNUCLEO53L0A1_SetIntrStateId(int EnableIntr, int DevNo){
    int status;
    IRQn_Type IntrNo;
    int IntrPin;

    switch( DevNo ){
    case XNUCLEO53L0A1_DEV_CENTER :
    case 'c' :
        IntrNo = VL53L0A1_GPIO1_C_INTx;
        IntrPin= VL53L0A1_GPIO1_C_GPIO_PIN;
        status = 0;
        break;
#if ! VL53L0A1_GPIO1_SHARED
    case XNUCLEO53L0A1_DEV_LEFT :
    case 'l' :
        IntrNo = VL53L0A1_GPIO1_L_INTx;
        IntrPin= VL53L0A1_GPIO1_L_GPIO_PIN;
        if( VL53L0A1_GPIO1_L_INTx == VL53L0A1_GPIO1_R_INTx || VL53L0A1_GPIO1_L_INTx == VL53L0A1_GPIO1_C_INTx){
        	debug_printf("Conflicting Exti for %d",DevNo);
            status = 1;
            // for treating as error un-comment
            //goto done;
        }
        else{
            status =0;
        }
        break;
    case 'r' :
    case XNUCLEO53L0A1_DEV_RIGHT :
        IntrNo = VL53L0A1_GPIO1_R_INTx;
        IntrPin= VL53L0A1_GPIO1_R_GPIO_PIN;
        if( VL53L0A1_GPIO1_L_INTx == VL53L0A1_GPIO1_R_INTx || VL53L0A1_GPIO1_R_INTx == VL53L0A1_GPIO1_C_INTx  ){
        	debug_printf("Conflicting Exti for %d",DevNo);
            status = 1;
            // for treating as error un-comment
            //goto done;
        }
        else{
            status =0;
        }

        break;
#endif
    default:
        debug_printf("Invalid DevNo %d",DevNo);
        status = -1;
        goto done;
    }

    if( EnableIntr ){
        __HAL_GPIO_EXTI_CLEAR_IT(IntrPin);
        NVIC_ClearPendingIRQ(IntrNo);
        HAL_NVIC_EnableIRQ(IntrNo);
        /**
         * @note  When enabling interrupt end user shall check actual state of the line and soft trigger event if active
         * Alternatively user can use API and device feature to clear device Interrupt status to possibly generates a new edge.
         * on shared pin configuration this must be repeated for all device.
         * The same shall be done after clearing a condition in device and interrupt remain active.
         */
    }
    else{
        HAL_NVIC_DisableIRQ(IntrNo);
        __HAL_GPIO_EXTI_CLEAR_IT(IntrPin);
        NVIC_ClearPendingIRQ(IntrNo);
    }


done:
    return status;
}


int XNUCLEO53L0A1_Init(void) {
    int status;
    uint8_t ExpanderData[2];
    XNUCLEO53L0A1_I2C1Configure();

    status = _ExpanderRd( I2cExpAddr0, 0, ExpanderData, 2);
    if (status != 0 || ExpanderData[0] != 0x00 || ExpanderData[1] != 0x16) {
        debug_printf("I2C Expander @0x%02X not detected",(int)I2cExpAddr0 );
        goto done_err;

