Keyrim/drone-stm32f1/Anciennes Versions/flight_controller_v2.1/lib/bsp/VL53L0X/X-NUCLEO-53L0A1.c
    }
    status = _ExpanderRd( I2cExpAddr1, 0, ExpanderData, 2);
    if (status != 0 || ExpanderData[0] != 0x00 || ExpanderData[1] != 0x16) {
    	debug_printf("I2C Expander @0x%02X not detected",(int)I2cExpAddr1);
        goto done_err;
    }

    CurIOVal.u32=0x0;
    /* setup expender   i/o direction  all output but exp1 bit 14*/
    ExpanderData[0] = 0xFF;
    ExpanderData[1] = 0xFF;
    status = _ExpanderWR(I2cExpAddr0, GPDR, ExpanderData, 2);
    if (status) {
    	debug_printf("Set Expander @0x%02X DR", I2cExpAddr0);
        goto done_err;
    }
    ExpanderData[0] = 0xFF;
    ExpanderData[1] = 0xBF; // all but bit 14-15 that is pb1 and xhurt
    status = _ExpanderWR(I2cExpAddr1, GPDR, ExpanderData, 2);
    if (status) {
    	debug_printf("Set Expander @0x%02X DR", I2cExpAddr1);
        goto done_err;
    }
    /* shut down all segment and all device */
    CurIOVal.u32=0x7F + (0x7F<<7) + (0x7F<<16)+(0x7F<<(16+7));
    status= _ExpandersSetAllIO();
    if( status ){
    	debug_printf("Set initial i/o ");
    }

done_err:
    return status;
}


int XNUCLEO53L0A1_GetPB1(int *state) {
    int status;
    uint8_t  PortValue;
    status= _ExpanderRd(I2cExpAddr1, GPMR+1, &PortValue,1);
    if( status == 0){
        if( PortValue&=0x40 )
            PortValue=1;
        else
            PortValue=0;
    }
    else{
    	debug_printf("i/o error");
    }
    *state = PortValue;
    return status;
}

int XNUCLEO53L0A1_ResetId(int DevNo, int state) {
    int status;
    switch( DevNo ){
    case XNUCLEO53L0A1_DEV_CENTER :
    case 'c' :
        CurIOVal.bytes[3]&=~0x80; /* bit 15 expender 1  => byte #3 */
        if( state )
            CurIOVal.bytes[3]|=0x80; /* bit 15 expender 1  => byte #3 */
        status= _ExpanderWR(I2cExpAddr1, GPSR+1, &CurIOVal.bytes[3], 1);
        break;
    case XNUCLEO53L0A1_DEV_LEFT :
    case 'l' :
        CurIOVal.bytes[1]&=~0x40; /* bit 14 expender 0 => byte #1*/
        if( state )
            CurIOVal.bytes[1]|=0x40; /* bit 14 expender 0 => byte #1*/
        status= _ExpanderWR(I2cExpAddr0, GPSR+1, &CurIOVal.bytes[1], 1);
        break;
    case 'r' :
    case XNUCLEO53L0A1_DEV_RIGHT :
        CurIOVal.bytes[1]&=~0x80; /* bit 15 expender 0  => byte #1 */
        if( state )
            CurIOVal.bytes[1]|=0x80; /* bit 15 expender 0 => byte #1*/
        status= _ExpanderWR(I2cExpAddr0, GPSR+1, &CurIOVal.bytes[1], 1);
        break;
    default:
    	debug_printf("Invalid DevNo %d",DevNo);
        status = -1;
        goto done;
    }
//error with valid id
    if( status ){
    	debug_printf("expander i/o error for DevNo %d state %d ",DevNo, state);
    }
done:
    return status;
}


void VL53L0A1_EXTI_IOConfigure(int DevNo, int  IntPriority, int SubPriority){
    GPIO_InitTypeDef GPIO_InitStruct;

    GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
    GPIO_InitStruct.Pull = VL53L0A1_INTR_PIN_PUPD;
    GPIO_InitStruct.Speed  = GPIO_SPEED_FREQ_HIGH;

    switch (DevNo ) {
    case XNUCLEO53L0A1_DEV_CENTER:
    case 'c':
        VL53L0A1_GPIO1_C_CLK_ENABLE();
        /*Configure GPIO pin : PA4 */
        GPIO_InitStruct.Pin = VL53L0A1_GPIO1_C_GPIO_PIN;

        XNUCLEO53L0A1_SetIntrStateId(0,XNUCLEO53L0A1_DEV_CENTER);
        HAL_GPIO_Init(VL53L0A1_GPIO1_C_GPIO_PORT, &GPIO_InitStruct);
        HAL_NVIC_SetPriority((IRQn_Type)VL53L0A1_GPIO1_C_GPIO_PIN, IntPriority, SubPriority);
        break;

#if VL53L0A1_GPIO1_SHARED == 0
    case XNUCLEO53L0A1_DEV_LEFT:
    case 'l':
        VL53L0A1_GPIO1_L_CLK_ENABLE();
        XNUCLEO53L0A1_SetIntrStateId(0,XNUCLEO53L0A1_DEV_LEFT);
        GPIO_InitStruct.Pin = VL53L0A1_GPIO1_L_GPIO_PIN;
        HAL_GPIO_Init(VL53L0A1_GPIO1_L_GPIO_PORT, &GPIO_InitStruct);
        HAL_NVIC_SetPriority(VL53L0A1_GPIO1_L_INTx, IntPriority, SubPriority);
        break;

    case XNUCLEO53L0A1_DEV_RIGHT:
        VL53L0A1_GPIO1_R_CLK_ENABLE();
        XNUCLEO53L0A1_SetIntrStateId(0,XNUCLEO53L0A1_DEV_RIGHT);
        GPIO_InitStruct.Pin = VL53L0A1_GPIO1_R_GPIO_PIN;
        HAL_GPIO_Init(VL53L0A1_GPIO1_R_GPIO_PORT, &GPIO_InitStruct);

        /* note that L and R are shared group on l053 i/o as interrupt*/
        HAL_NVIC_SetPriority(VL53L0A1_GPIO1_R_INTx, IntPriority, SubPriority);
        break;
#endif
    }
}

void VL53L0A1_EXTI_IOUnconfigure(int DevNo){
    switch (DevNo ) {
    case XNUCLEO53L0A1_DEV_CENTER:
    case 'c':
        //XNUCLEO53L0A1_SetIntrStateId(0,XNUCLEO53L0A1_DEV_TOP);
        HAL_GPIO_DeInit(VL53L0A1_GPIO1_C_GPIO_PORT, VL53L0A1_GPIO1_C_GPIO_PIN);
        __HAL_GPIO_EXTI_CLEAR_IT(VL53L0A1_GPIO1_C_GPIO_PIN);
        break;

#if VL53L0A1_GPIO1_SHARED == 0
    case XNUCLEO53L0A1_DEV_LEFT:
    case 'l':
       // XNUCLEO53L0A1_SetIntrStateId(0,XNUCLEO53L0A1_DEV_LEFT);
        HAL_GPIO_DeInit(VL53L0A1_GPIO1_L_GPIO_PORT, VL53L0A1_GPIO1_L_GPIO_PIN);
        __HAL_GPIO_EXTI_CLEAR_IT(VL53L0A1_GPIO1_L_GPIO_PIN);
        break;

    case XNUCLEO53L0A1_DEV_RIGHT:
    case 'r':
        HAL_GPIO_DeInit(VL53L0A1_GPIO1_R_GPIO_PORT, VL53L0A1_GPIO1_R_GPIO_PIN);
        __HAL_GPIO_EXTI_CLEAR_IT(VL53L0A1_GPIO1_R_GPIO_PIN);
        //XNUCLEO53L0A1_SetIntrStateId(0,XNUCLEO53L0A1_DEV_RIGHT);
        break;
#endif
    }
}
/**
 * Set all i2c expended gpio in one go
 * @return i/o operation status
 */
static int _ExpandersSetAllIO(void){
    int status;
    status = _ExpanderWR(I2cExpAddr0, GPSR, &CurIOVal.bytes[0], 2);
    if( status ){
        goto done_err;
    }
    status = _ExpanderWR(I2cExpAddr1, GPSR, &CurIOVal.bytes[2], 2);
done_err:
    return status;
}

/**
 * STMPE1600  i2c Expender register read
 * @param I2cExpAddr Expender address
 * @param index      register index
 * @param data       read data buffer
 * @param n_data     number of byte to read
 * @return           of if ok else i2c I/O operation status
 */
static int _ExpanderRd(int I2cExpAddr, int index, uint8_t *data, int n_data) {

    int status;
    uint8_t RegAddr;
    RegAddr = index;
    XNUCLEO53L0A1_GetI2cBus();
    do {

    	status = I2C_ReadMulti(I2C1, I2cExpAddr, index, data,  n_data);
       /* status = HAL_I2C_Master_Transmit(&XNUCLEO53L0A1_hi2c, I2cExpAddr, &RegAddr, 1, 100);
        if (status)
            break;
        status = HAL_I2C_Master_Receive(&XNUCLEO53L0A1_hi2c, I2cExpAddr, data, n_data, n_data * 100);*/
    } while (0);
    XNUCLEO53L0A1_PutI2cBus();
    return status;
}

/**
 * STMPE1600 i2c Expender register write
 * @param I2cExpAddr Expender address
 * @param index      register index
 * @param data       data buffer
 * @param n_data     number of byte to write
 * @return           of if ok else i2c I/O operation status
 */
static int _ExpanderWR(int I2cExpAddr, int index, uint8_t *data, int n_data) {

